const data = {
  category: {
    guwen: {
      name: '古文',
      key: 'guwen',
      icon: 'mui-icon mui-icon-contact',
      data: {
        guwen__quanxue: {
          name: '劝学',
          key: 'guwen__quanxue',
          author: '先秦：荀子',
          data: [{
              paragraph: '君子曰：学不可以已。'
            },
            {
              paragraph: '青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，輮以为轮，其曲中规。虽有槁暴（pù），不复挺者，輮使之然也。故木受绳则直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。'
            },
            {
              paragraph: '故不登高山，不知天之高也；不临深溪，不知地之厚也；不闻先王之遗言，不知学问之大也。干、越、夷、貉之子，生而同声，长而异俗，教使之然也。诗曰：“嗟尔君子，无恒安息。靖共尔位，好是正直。神之听之，介尔景福。”神莫大于化道，福莫长于无祸。'
            },
            {
              paragraph: '吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。(君子生 通：性)'
            },
            {
              paragraph: '南方有鸟焉，名曰蒙鸠，以羽为巢，而编之以发，系之苇苕，风至苕折，卵破子死。巢非不完也，所系者然也。西方有木焉，名曰射干，茎长四寸，生于高山之上，而临百仞之渊，木茎非能长也，所立者然也。蓬生麻中，不扶而直；白沙在涅，与之俱黑。兰槐之根是为芷，其渐之滫，君子不近，庶人不服。其质非不美也，所渐者然也。故君子居必择乡，游必就士，所以防邪辟而近中正也。'
            },
            {
              paragraph: '物类之起，必有所始。荣辱之来，必象其德。肉腐出虫，鱼枯生蠹。怠慢忘身，祸灾乃作。强自取柱，柔自取束。邪秽在身，怨之所构。施薪若一，火就燥也，平地若一，水就湿也。草木畴生，禽兽群焉，物各从其类也。是故质的张，而弓矢至焉；林木茂，而斧斤至焉；树成荫，而众鸟息焉。醯酸，而蚋聚焉。故言有招祸也，行有招辱也，君子慎其所立乎！'
            },
            {
              paragraph: '积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。'
            },
            {
              paragraph: '是故无冥冥之志者，无昭昭之明；无惛惛之事者，无赫赫之功。行衢道者不至，事两君者不容。目不能两视而明，耳不能两听而聪。螣蛇无足而飞，鼫鼠五技而穷。《诗》曰：“尸鸠在桑，其子七兮。淑人君子，其仪一兮。其仪一兮，心如结兮！”故君子结于一也。'
            },
            {
              paragraph: '昔者瓠巴鼓瑟，而流鱼出听；伯牙鼓琴，而六马仰秣。故声无小而不闻，行无隐而不形 。玉在山而草木润，渊生珠而崖不枯。为善不积邪？安有不闻者乎？'
            },
            {
              paragraph: '学恶乎始？恶乎终？曰：其数则始乎诵经，终乎读礼；其义则始乎为士，终乎为圣人， 真积力久则入，学至乎没而后止也。故学数有终，若其义则不可须臾舍也。为之，人也；舍 之，禽兽也。故书者，政事之纪也；诗者，中声之所止也；礼者，法之大分，类之纲纪也。 故学至乎礼而止矣。夫是之谓道德之极。礼之敬文也，乐之中和也，诗书之博也，春秋之微 也，在天地之间者毕矣。 君子之学也，入乎耳，着乎心，布乎四体，形乎动静。端而言，蝡而动，一可以为法则。小人之学也，入乎耳，出乎口；口耳之间，则四寸耳，曷足以美七尺之躯哉！古之学者为己，今之学者为人。君子之学也，以美其身；小人之学也，以为禽犊。故不问而告谓之傲，问一而告二谓之囋。傲、非也，囋、非也；君子如向矣。'
            },
            {
              paragraph: '学莫便乎近其人。礼乐法而不说，诗书故而不切，春秋约而不速。方其人之习君子之说，则尊以遍矣，周于世矣。故曰：学莫便乎近其人。'
            },
            {
              paragraph: '学之经莫速乎好其人，隆礼次之。上不能好其人，下不能隆礼，安特将学杂识志，顺诗书而已耳。则末世穷年，不免为陋儒而已。将原先王，本仁义，则礼正其经纬蹊径也。若挈裘领，诎五指而顿之，顺者不可胜数也。不道礼宪，以诗书为之，譬之犹以指测河也，以戈舂黍也，以锥餐壶也，不可以得之矣。故隆礼，虽未明，法士也；不隆礼，虽察辩，散儒也。'
            },
            {
              paragraph: '问楛者，勿告也；告楛者，勿问也；说楛者，勿听也。有争气者，勿与辩也。故必由其道至，然后接之；非其道则避之。故礼恭，而后可与言道之方；辞顺，而后可与言道之理；色从而后可与言道之致。故未可与言而言，谓之傲；可与言而不言，谓之隐；不观气色而言，谓瞽。故君子不傲、不隐、不瞽，谨顺其身。诗曰：“匪交匪舒，天子所予。”此之谓也。'
            },
            {
              paragraph: '百发失一，不足谓善射；千里蹞步不至，不足谓善御；伦类不通，仁义不一，不足谓善学。学也者，固学一之也。一出焉，一入焉，涂巷之人也；其善者少，不善者多，桀纣盗跖也；全之尽之，然后学者也。'
            },
            {
              paragraph: '君子知夫不全不粹之不足以为美也，故诵数以贯之，思索以通之，为其人以处之，除其害者以持养之。使目非是无欲见也，使耳非是无欲闻也，使口非是无欲言也，使心非是无欲虑也。及至其致好之也，目好之五色，耳好之五声，口好之五味，心利之有天下。是故权利不能倾也，群众不能移也，天下不能荡也。生乎由是，死乎由是，夫是之谓德操。德操然后能定，能定然后能应。能定能应，夫是之谓成人。天见其明，地见其光，君子贵其全也。'
            },
          ]
        }
      }
    },
    prose: {
      name: '散文',
      key: 'prose',
      icon: 'mui-icon mui-icon-person',
      data: {
        prose__chun: {
          name: '春',
          key: 'prose__chun',
          author: '1933年左右 | 朱自清 | 《朱自清全集》',
          data: [{
              paragraph: '盼望着，盼望着，东风来了，春天的脚步近了。 '
            },
            {
              paragraph: '一切都像刚睡醒的样子，欣欣然张开了眼。山朗润起来了，水涨起来了，太阳的脸红起来了。'
            },
            {
              paragraph: '小草偷偷地从土里钻出来，嫩嫩的，绿绿的。园子里，田野里，瞧去，一大片一大片满是的。坐着，躺着，打两个滚，踢几脚球，赛几趟跑，捉几回迷藏。风轻悄悄的，草软绵绵的。'
            },
            {
              paragraph: '桃树、杏树、梨树，你不让我，我不让你，都开满了花赶趟儿。红的像火，粉的像霞，白的像雪。花里带着甜味儿；闭了眼，树上仿佛已经满是桃儿、杏儿、梨儿。花下成千成百的蜜蜂嗡嗡地闹着，大小的蝴蝶飞来飞去。野花遍地是：杂样儿，有名字的，没名字的，散在草丛里，像眼睛，像星星，还眨呀眨的。'
            },
            {
              paragraph: '“吹面不寒杨柳风”，不错的，像母亲的手抚摸着你。风里带来些新翻的泥土的气息，混着青草味儿，还有各种花的香，都在微微润湿的空气里酝酿。鸟儿将巢安在繁花嫩叶当中，高兴起来了，呼朋引伴地卖弄清脆的喉咙，唱出宛转的曲子，与轻风流水应和着。牛背上牧童的短笛，这时候也成天嘹亮地响着。'
            },
            {
              paragraph: '雨是最寻常的，一下就是三两天。可别恼。看，像牛毛，像花针，像细丝，密密地斜织着，人家屋顶上全笼着一层薄烟。树叶儿却绿得发亮，小草儿也青得逼你的眼。傍晚时候，上灯了，一点点黄晕的光，烘托出一片安静而和平的夜。在乡下，小路上，石桥边，有撑起伞慢慢走着的人，地里还有工作的农民，披着蓑戴着笠。他们的房屋，稀稀疏疏的在雨里静默着。'
            },
            {
              paragraph: '天上风筝渐渐多了，地上孩子也多了。城里乡下，家家户户，老老小小，也赶趟儿似的，一个个都出来了。舒活舒活筋骨，抖擞抖擞精神，各做各的一份事去。“一年之计在于春”，刚起头儿，有的是工夫，有的是希望。'
            },
            {
              paragraph: '春天像刚落地的娃娃，从头到脚都是新的，它生长着。'
            },
            {
              paragraph: '春天像小姑娘，花枝招展的，笑着，走着。'
            },
            {
              paragraph: '春天像健壮的青年，有铁一般的胳膊和腰脚，领着我们上前去。'
            }
          ]
        },
        prose__the_sea_beyond_the_mountains: {
          name: '在山的那边',
          key: 'prose__the_sea_beyond_the_mountains',
          author: '1981年 | 王家新 | 《山那边的海》',
          data: [{
              paragraph: '小时候，我常伏在窗口痴想——'
            },
            {
              paragraph: '山那边是什么呢?'
            },
            {
              paragraph: '妈妈给我说过：海'
            },
            {
              paragraph: '哦，山那边是海吗？'
            },
            {
              paragraph: '于是，怀着一种隐秘的想望'
            },
            {
              paragraph: '有一天我终于爬上了那个山顶'
            },
            {
              paragraph: '可是，我却几乎是哭着回来了——'
            },
            {
              paragraph: '在山的那边，依然是山'
            },
            {
              paragraph: '山那边的山啊，铁青着脸'
            },
            {
              paragraph: '给我的幻想打了一个零分！'
            },
            {
              paragraph: '妈妈，那个海呢？'
            },
            {
              paragraph: '在山的那边，是海！'
            },
            {
              paragraph: '是用信念凝成的海'
            },
            {
              paragraph: '今天啊，我竟没想到'
            },
            {
              paragraph: '一颗从小飘来的种子'
            },
            {
              paragraph: '却在我的心中扎下了深根'
            },
            {
              paragraph: '是的，我曾一次又一次的失望过'
            },
            {
              paragraph: '当我爬上那一座座诱惑着我的山顶'
            },
            {
              paragraph: '但我又一次次鼓起信心向前走去'
            },
            {
              paragraph: '因为我听到海依然在远方为我喧腾——'
            },
            {
              paragraph: '那雪白的海潮啊，夜夜奔来'
            },
            {
              paragraph: '一次次浸湿了我枯干的心灵……'
            },
            {
              paragraph: '在山的那边，是海吗？'
            },
            {
              paragraph: '是的！'
            },
            {
              paragraph: '人们啊，请相信——'
            },
            {
              paragraph: '在不停地翻过无数座山后'
            },
            {
              paragraph: '在一次次地战胜失望之后'
            },
            {
              paragraph: '你终会攀上这样一座山顶'
            },
            {
              paragraph: '而在这座山的那边，就是海呀'
            },
            {
              paragraph: '是一个全新的世界'
            },
            {
              paragraph: '在一瞬间照亮你的眼睛……'
            }
          ]
        }
      }
    }
  }
};